Repository: linuxdeepin/deepin-pw-check
Catalog: misc/po/*.po
Languages: de, es

source: Checking successful
de: Überprüfung erfolgreich
es: Verificación exitosa

source: The password cannot be empty
de: Das Passwort darf nicht leer sein
es: La contraseña no puede estar vacía

source: Minimum of %d characters. At least %d types: 0-9, a-z, A-Z and symbols. Different from the username.
de: Mindestens %d Zeichen. Mindestens %d Typen: 0-9, a-z, A-Z und Symbole. Anders als der Benutzername.
es: Mínimo de %d caracteres. Al menos %d tipos: 0-9, a-z, A-Z y símbolos. Diferente del nombre de usuario.

source: Password must be no more than %d characters
de: Passwort darf nicht mehr als %d Zeichen haben
es: La contraseña no debe tener más de %d caracteres

source: Password can only contain English letters (case-sensitive), numbers or special symbols (~`!@#$%^&*()-_+=|\{}[]:"'<>,.?/)
de: Passwort darf nur englische Buchstaben (Groß- und Kleinschreibung beachten), Zahlen oder Sonderzeichen (~`!@#$%^&*()-_+=|\{}[]:"'<>,.?/) enthalten
es: La contraseña debe contener letras latinas (sensible a mayúsculas), números o símbolos (~`!@#$%^&*()-_+=|\{}[]:"'<>,.?/)

source: Password must not contain more than %d palindrome characters
de: Passwort darf nicht mehr als %d Palindrom-Zeichen enthalten
es: La contraseña no puede tener más de %d caracteres palíndromos

source: Create a strong password please
de: Bitte erstellen Sie ein sicheres Passwort
es: Por favor, cree una contraseña fuerte

source: Do not use common words and combinations as password
de: Verwenden Sie keine gebräuchlichen Wörter und Kombinationen als Passwort
es: No use palabras o combinaciones comunes como contraseña

source: Parameter options are invalid
de: Parameteroptionen sind ungültig
es: Las opciones parametrales no son válidas

source: Internal error
de: Interner Fehler
es: Error interno

source: Invalid user
de: Ungültiger Benutzer
es: Usuario invalido

source: It does not meet password rules
de: Es erfüllt nicht die Passwortregeln
es: No cumple con las reglas de la contraseña

source: Invalid error type
de: Ungültiger Fehlertyp
es: Error de tipo inválido
